Microchip-MPLAB-Harmony/csp/apps/rtc/rtc_alarm/firmware/src/packs/ATSAMA5D27_DFP/component/saic.h
/**
 * \brief Header file for SAMA5D2/SAMA5D2 SAIC
 *
 * Copyright (c) 2017-2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-10-05T01:07:33Z */
#ifndef SAMA5D2_SAMA5D2_SAIC_MODULE_H
#define SAMA5D2_SAMA5D2_SAIC_MODULE_H

/** \addtogroup SAMA5D2_SAMA5D2 Secure Advanced Interrupt Controller
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR SAMA5D2_SAIC                                 */
/* ========================================================================== */

/* -------- SAIC_SSR : (SAIC Offset: 0x00) (R/W 32) Source Select Register -------- */
#define SAIC_SSR_INTSEL_Pos                   (0U)                                           /**< (SAIC_SSR) Interrupt Line Selection Position */
#define SAIC_SSR_INTSEL_Msk                   (0x7FU << SAIC_SSR_INTSEL_Pos)                 /**< (SAIC_SSR) Interrupt Line Selection Mask */
#define SAIC_SSR_INTSEL(value)                (SAIC_SSR_INTSEL_Msk & ((value) << SAIC_SSR_INTSEL_Pos))
#define SAIC_SSR_Msk                          (0x0000007FUL)                                 /**< (SAIC_SSR) Register Mask  */

/* -------- SAIC_SMR : (SAIC Offset: 0x04) (R/W 32) Source Mode Register -------- */
#define SAIC_SMR_PRIORITY_Pos                 (0U)                                           /**< (SAIC_SMR) Priority Level Position */
#define SAIC_SMR_PRIORITY_Msk                 (0x7U << SAIC_SMR_PRIORITY_Pos)                /**< (SAIC_SMR) Priority Level Mask */
#define SAIC_SMR_PRIORITY(value)              (SAIC_SMR_PRIORITY_Msk & ((value) << SAIC_SMR_PRIORITY_Pos))
#define   SAIC_SMR_PRIORITY_MINIMUM_Val       (0U)                                           /**< (SAIC_SMR) Minimum priority  */
#define   SAIC_SMR_PRIORITY_VERY_LOW_Val      (1U)                                           /**< (SAIC_SMR) Very low priority  */
#define   SAIC_SMR_PRIORITY_LOW_Val           (2U)                                           /**< (SAIC_SMR) Low priority  */
#define   SAIC_SMR_PRIORITY_MEDIUM_LOW_Val    (3U)                                           /**< (SAIC_SMR) Medium priority  */
#define   SAIC_SMR_PRIORITY_MEDIUM_HIGH_Val   (4U)                                           /**< (SAIC_SMR) Medium-high priority  */
#define   SAIC_SMR_PRIORITY_HIGH_Val          (5U)                                           /**< (SAIC_SMR) High priority  */
#define   SAIC_SMR_PRIORITY_VERY_HIGH_Val     (6U)                                           /**< (SAIC_SMR) Very high priority  */
#define   SAIC_SMR_PRIORITY_MAXIMUM_Val       (7U)                                           /**< (SAIC_SMR) Maximum priority  */
#define SAIC_SMR_PRIORITY_MINIMUM             (SAIC_SMR_PRIORITY_MINIMUM_Val << SAIC_SMR_PRIORITY_Pos) /**< (SAIC_SMR) Minimum priority Position  */
#define SAIC_SMR_PRIORITY_VERY_LOW            (SAIC_SMR_PRIORITY_VERY_LOW_Val << SAIC_SMR_PRIORITY_Pos) /**< (SAIC_SMR) Very low priority Position  */
#define SAIC_SMR_PRIORITY_LOW                 (SAIC_SMR_PRIORITY_LOW_Val << SAIC_SMR_PRIORITY_Pos) /**< (SAIC_SMR) Low priority Position  */
#define SAIC_SMR_PRIORITY_MEDIUM_LOW          (SAIC_SMR_PRIORITY_MEDIUM_LOW_Val << SAIC_SMR_PRIORITY_Pos) /**< (SAIC_SMR) Medium priority Position  */
#define SAIC_SMR_PRIORITY_MEDIUM_HIGH         (SAIC_SMR_PRIORITY_MEDIUM_HIGH_Val << SAIC_SMR_PRIORITY_Pos) /**< (SAIC_SMR) Medium-high priority Position  */
#define SAIC_SMR_PRIORITY_HIGH                (SAIC_SMR_PRIORITY_HIGH_Val << SAIC_SMR_PRIORITY_Pos) /**< (SAIC_SMR) High priority Position  */
#define SAIC_SMR_PRIORITY_VERY_HIGH           (SAIC_SMR_PRIORITY_VERY_HIGH_Val << SAIC_SMR_PRIORITY_Pos) /**< (SAIC_SMR) Very high priority Position  */
#define SAIC_SMR_PRIORITY_MAXIMUM             (SAIC_SMR_PRIORITY_MAXIMUM_Val << SAIC_SMR_PRIORITY_Pos) /**< (SAIC_SMR) Maximum priority Position  */
#define SAIC_SMR_SRCTYPE_Pos                  (5U)                                           /**< (SAIC_SMR) Interrupt Source Type Position */
#define SAIC_SMR_SRCTYPE_Msk                  (0x3U << SAIC_SMR_SRCTYPE_Pos)                 /**< (SAIC_SMR) Interrupt Source Type Mask */
#define SAIC_SMR_SRCTYPE(value)               (SAIC_SMR_SRCTYPE_Msk & ((value) << SAIC_SMR_SRCTYPE_Pos))
#define   SAIC_SMR_SRCTYPE_INT_LEVEL_SENSITIVE_Val (0U)                                           /**< (SAIC_SMR) High-level sensitive for internal source. Low-level sensitive for external source  */
#define   SAIC_SMR_SRCTYPE_EXT_NEGATIVE_EDGE_Val (1U)                                           /**< (SAIC_SMR) Negative-edge triggered for external source  */
#define   SAIC_SMR_SRCTYPE_EXT_HIGH_LEVEL_Val (2U)                                           /**< (SAIC_SMR) High-level sensitive for internal source. High-level sensitive for external source  */
#define   SAIC_SMR_SRCTYPE_EXT_POSITIVE_EDGE_Val (3U)                                           /**< (SAIC_SMR) Positive-edge triggered for external source  */
#define SAIC_SMR_SRCTYPE_INT_LEVEL_SENSITIVE  (SAIC_SMR_SRCTYPE_INT_LEVEL_SENSITIVE_Val << SAIC_SMR_SRCTYPE_Pos) /**< (SAIC_SMR) High-level sensitive for internal source. Low-level sensitive for external source Position  */
#define SAIC_SMR_SRCTYPE_EXT_NEGATIVE_EDGE    (SAIC_SMR_SRCTYPE_EXT_NEGATIVE_EDGE_Val << SAIC_SMR_SRCTYPE_Pos) /**< (SAIC_SMR) Negative-edge triggered for external source Position  */
#define SAIC_SMR_SRCTYPE_EXT_HIGH_LEVEL       (SAIC_SMR_SRCTYPE_EXT_HIGH_LEVEL_Val << SAIC_SMR_SRCTYPE_Pos) /**< (SAIC_SMR) High-level sensitive for internal source. High-level sensitive for external source Position  */
#define SAIC_SMR_SRCTYPE_EXT_POSITIVE_EDGE    (SAIC_SMR_SRCTYPE_EXT_POSITIVE_EDGE_Val << SAIC_SMR_SRCTYPE_Pos) /**< (SAIC_SMR) Positive-edge triggered for external source Position  */
#define SAIC_SMR_Msk                          (0x00000067UL)                                 /**< (SAIC_SMR) Register Mask  */

/* -------- SAIC_SVR : (SAIC Offset: 0x08) (R/W 32) Source Vector Register -------- */
#define SAIC_SVR_VECTOR_Pos                   (0U)                                           /**< (SAIC_SVR) Source Vector Position */
#define SAIC_SVR_VECTOR_Msk                   (0xFFFFFFFFU << SAIC_SVR_VECTOR_Pos)           /**< (SAIC_SVR) Source Vector Mask */
#define SAIC_SVR_VECTOR(value)                (SAIC_SVR_VECTOR_Msk & ((value) << SAIC_SVR_VECTOR_Pos))
#define SAIC_SVR_Msk                          (0xFFFFFFFFUL)                                 /**< (SAIC_SVR) Register Mask  */

/* -------- SAIC_IVR : (SAIC Offset: 0x10) (R/  32) Interrupt Vector Register -------- */
#define SAIC_IVR_IRQV_Pos                     (0U)                                           /**< (SAIC_IVR) Interrupt Vector Register Position */
#define SAIC_IVR_IRQV_Msk                     (0xFFFFFFFFU << SAIC_IVR_IRQV_Pos)             /**< (SAIC_IVR) Interrupt Vector Register Mask */
#define SAIC_IVR_IRQV(value)                  (SAIC_IVR_IRQV_Msk & ((value) << SAIC_IVR_IRQV_Pos))
#define SAIC_IVR_Msk                          (0xFFFFFFFFUL)                                 /**< (SAIC_IVR) Register Mask  */

/* -------- SAIC_FVR : (SAIC Offset: 0x14) (R/  32) FIQ Vector Register -------- */
#define SAIC_FVR_FIQV_Pos                     (0U)                                           /**< (SAIC_FVR) FIQ Vector Register Position */
#define SAIC_FVR_FIQV_Msk                     (0xFFFFFFFFU << SAIC_FVR_FIQV_Pos)             /**< (SAIC_FVR) FIQ Vector Register Mask */
#define SAIC_FVR_FIQV(value)                  (SAIC_FVR_FIQV_Msk & ((value) << SAIC_FVR_FIQV_Pos))
#define SAIC_FVR_Msk                          (0xFFFFFFFFUL)                                 /**< (SAIC_FVR) Register Mask  */

/* -------- SAIC_ISR : (SAIC Offset: 0x18) (R/  32) Interrupt Status Register -------- */
#define SAIC_ISR_IRQID_Pos                    (0U)                                           /**< (SAIC_ISR) Current Interrupt Identifier Position */
#define SAIC_ISR_IRQID_Msk                    (0x7FU << SAIC_ISR_IRQID_Pos)                  /**< (SAIC_ISR) Current Interrupt Identifier Mask */
#define SAIC_ISR_IRQID(value)                 (SAIC_ISR_IRQID_Msk & ((value) << SAIC_ISR_IRQID_Pos))
#define SAIC_ISR_Msk                          (0x0000007FUL)                                 /**< (SAIC_ISR) Register Mask  */

