Microchip-MPLAB-Harmony/csp/apps/rtc/rtc_alarm/firmware/src/packs/ATSAMA5D27_DFP/component/saic.h
/* -------- SAIC_IPR0 : (SAIC Offset: 0x20) (R/  32) Interrupt Pending Register 0 -------- */
#define SAIC_IPR0_PID0_SAIC_FIQ_Pos           (0U)                                           /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID0_SAIC_FIQ_Msk           (0x1U << SAIC_IPR0_PID0_SAIC_FIQ_Pos)          /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID0_SAIC_FIQ(value)        (SAIC_IPR0_PID0_SAIC_FIQ_Msk & ((value) << SAIC_IPR0_PID0_SAIC_FIQ_Pos))
#define SAIC_IPR0_PID2_PMU_Pos                (2U)                                           /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID2_PMU_Msk                (0x1U << SAIC_IPR0_PID2_PMU_Pos)               /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID2_PMU(value)             (SAIC_IPR0_PID2_PMU_Msk & ((value) << SAIC_IPR0_PID2_PMU_Pos))
#define SAIC_IPR0_PID3_PIT_Pos                (3U)                                           /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID3_PIT_Msk                (0x1U << SAIC_IPR0_PID3_PIT_Pos)               /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID3_PIT(value)             (SAIC_IPR0_PID3_PIT_Msk & ((value) << SAIC_IPR0_PID3_PIT_Pos))
#define SAIC_IPR0_PID4_WDT_Pos                (4U)                                           /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID4_WDT_Msk                (0x1U << SAIC_IPR0_PID4_WDT_Pos)               /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID4_WDT(value)             (SAIC_IPR0_PID4_WDT_Msk & ((value) << SAIC_IPR0_PID4_WDT_Pos))
#define SAIC_IPR0_PID5_GMAC_Pos               (5U)                                           /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID5_GMAC_Msk               (0x1U << SAIC_IPR0_PID5_GMAC_Pos)              /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID5_GMAC(value)            (SAIC_IPR0_PID5_GMAC_Msk & ((value) << SAIC_IPR0_PID5_GMAC_Pos))
#define SAIC_IPR0_PID6_XDMAC0_Pos             (6U)                                           /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID6_XDMAC0_Msk             (0x1U << SAIC_IPR0_PID6_XDMAC0_Pos)            /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID6_XDMAC0(value)          (SAIC_IPR0_PID6_XDMAC0_Msk & ((value) << SAIC_IPR0_PID6_XDMAC0_Pos))
#define SAIC_IPR0_PID7_XDMAC1_Pos             (7U)                                           /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID7_XDMAC1_Msk             (0x1U << SAIC_IPR0_PID7_XDMAC1_Pos)            /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID7_XDMAC1(value)          (SAIC_IPR0_PID7_XDMAC1_Msk & ((value) << SAIC_IPR0_PID7_XDMAC1_Pos))
#define SAIC_IPR0_PID8_ICM_Pos                (8U)                                           /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID8_ICM_Msk                (0x1U << SAIC_IPR0_PID8_ICM_Pos)               /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID8_ICM(value)             (SAIC_IPR0_PID8_ICM_Msk & ((value) << SAIC_IPR0_PID8_ICM_Pos))
#define SAIC_IPR0_PID9_AES_Pos                (9U)                                           /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID9_AES_Msk                (0x1U << SAIC_IPR0_PID9_AES_Pos)               /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID9_AES(value)             (SAIC_IPR0_PID9_AES_Msk & ((value) << SAIC_IPR0_PID9_AES_Pos))
#define SAIC_IPR0_PID10_AESB_Pos              (10U)                                          /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID10_AESB_Msk              (0x1U << SAIC_IPR0_PID10_AESB_Pos)             /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID10_AESB(value)           (SAIC_IPR0_PID10_AESB_Msk & ((value) << SAIC_IPR0_PID10_AESB_Pos))
#define SAIC_IPR0_PID11_TDES_Pos              (11U)                                          /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID11_TDES_Msk              (0x1U << SAIC_IPR0_PID11_TDES_Pos)             /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID11_TDES(value)           (SAIC_IPR0_PID11_TDES_Msk & ((value) << SAIC_IPR0_PID11_TDES_Pos))
#define SAIC_IPR0_PID12_SHA_Pos               (12U)                                          /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID12_SHA_Msk               (0x1U << SAIC_IPR0_PID12_SHA_Pos)              /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID12_SHA(value)            (SAIC_IPR0_PID12_SHA_Msk & ((value) << SAIC_IPR0_PID12_SHA_Pos))
#define SAIC_IPR0_PID13_MPDDRC_Pos            (13U)                                          /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID13_MPDDRC_Msk            (0x1U << SAIC_IPR0_PID13_MPDDRC_Pos)           /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID13_MPDDRC(value)         (SAIC_IPR0_PID13_MPDDRC_Msk & ((value) << SAIC_IPR0_PID13_MPDDRC_Pos))
#define SAIC_IPR0_PID14_MATRIX1_Pos           (14U)                                          /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID14_MATRIX1_Msk           (0x1U << SAIC_IPR0_PID14_MATRIX1_Pos)          /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID14_MATRIX1(value)        (SAIC_IPR0_PID14_MATRIX1_Msk & ((value) << SAIC_IPR0_PID14_MATRIX1_Pos))
#define SAIC_IPR0_PID15_MATRIX0_Pos           (15U)                                          /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID15_MATRIX0_Msk           (0x1U << SAIC_IPR0_PID15_MATRIX0_Pos)          /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID15_MATRIX0(value)        (SAIC_IPR0_PID15_MATRIX0_Msk & ((value) << SAIC_IPR0_PID15_MATRIX0_Pos))
#define SAIC_IPR0_PID16_SECUMOD_Pos           (16U)                                          /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID16_SECUMOD_Msk           (0x1U << SAIC_IPR0_PID16_SECUMOD_Pos)          /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID16_SECUMOD(value)        (SAIC_IPR0_PID16_SECUMOD_Msk & ((value) << SAIC_IPR0_PID16_SECUMOD_Pos))
#define SAIC_IPR0_PID17_HSMC_Pos              (17U)                                          /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID17_HSMC_Msk              (0x1U << SAIC_IPR0_PID17_HSMC_Pos)             /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID17_HSMC(value)           (SAIC_IPR0_PID17_HSMC_Msk & ((value) << SAIC_IPR0_PID17_HSMC_Pos))
#define SAIC_IPR0_PID18_PIOA_Pos              (18U)                                          /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID18_PIOA_Msk              (0x1U << SAIC_IPR0_PID18_PIOA_Pos)             /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID18_PIOA(value)           (SAIC_IPR0_PID18_PIOA_Msk & ((value) << SAIC_IPR0_PID18_PIOA_Pos))
#define SAIC_IPR0_PID19_FLEXCOM0_Pos          (19U)                                          /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID19_FLEXCOM0_Msk          (0x1U << SAIC_IPR0_PID19_FLEXCOM0_Pos)         /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID19_FLEXCOM0(value)       (SAIC_IPR0_PID19_FLEXCOM0_Msk & ((value) << SAIC_IPR0_PID19_FLEXCOM0_Pos))
#define SAIC_IPR0_PID20_FLEXCOM1_Pos          (20U)                                          /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID20_FLEXCOM1_Msk          (0x1U << SAIC_IPR0_PID20_FLEXCOM1_Pos)         /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID20_FLEXCOM1(value)       (SAIC_IPR0_PID20_FLEXCOM1_Msk & ((value) << SAIC_IPR0_PID20_FLEXCOM1_Pos))
#define SAIC_IPR0_PID22_FLEXCOM3_Pos          (22U)                                          /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID22_FLEXCOM3_Msk          (0x1U << SAIC_IPR0_PID22_FLEXCOM3_Pos)         /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID22_FLEXCOM3(value)       (SAIC_IPR0_PID22_FLEXCOM3_Msk & ((value) << SAIC_IPR0_PID22_FLEXCOM3_Pos))
#define SAIC_IPR0_PID23_FLEXCOM4_Pos          (23U)                                          /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID23_FLEXCOM4_Msk          (0x1U << SAIC_IPR0_PID23_FLEXCOM4_Pos)         /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID23_FLEXCOM4(value)       (SAIC_IPR0_PID23_FLEXCOM4_Msk & ((value) << SAIC_IPR0_PID23_FLEXCOM4_Pos))
#define SAIC_IPR0_PID24_UART0_Pos             (24U)                                          /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID24_UART0_Msk             (0x1U << SAIC_IPR0_PID24_UART0_Pos)            /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID24_UART0(value)          (SAIC_IPR0_PID24_UART0_Msk & ((value) << SAIC_IPR0_PID24_UART0_Pos))
#define SAIC_IPR0_PID25_UART1_Pos             (25U)                                          /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID25_UART1_Msk             (0x1U << SAIC_IPR0_PID25_UART1_Pos)            /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID25_UART1(value)          (SAIC_IPR0_PID25_UART1_Msk & ((value) << SAIC_IPR0_PID25_UART1_Pos))
#define SAIC_IPR0_PID26_UART2_Pos             (26U)                                          /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID26_UART2_Msk             (0x1U << SAIC_IPR0_PID26_UART2_Pos)            /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID26_UART2(value)          (SAIC_IPR0_PID26_UART2_Msk & ((value) << SAIC_IPR0_PID26_UART2_Pos))
#define SAIC_IPR0_PID27_UART3_Pos             (27U)                                          /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID27_UART3_Msk             (0x1U << SAIC_IPR0_PID27_UART3_Pos)            /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID27_UART3(value)          (SAIC_IPR0_PID27_UART3_Msk & ((value) << SAIC_IPR0_PID27_UART3_Pos))
#define SAIC_IPR0_PID28_UART4_Pos             (28U)                                          /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID28_UART4_Msk             (0x1U << SAIC_IPR0_PID28_UART4_Pos)            /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID28_UART4(value)          (SAIC_IPR0_PID28_UART4_Msk & ((value) << SAIC_IPR0_PID28_UART4_Pos))
#define SAIC_IPR0_PID29_TWIHS0_Pos            (29U)                                          /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID29_TWIHS0_Msk            (0x1U << SAIC_IPR0_PID29_TWIHS0_Pos)           /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID29_TWIHS0(value)         (SAIC_IPR0_PID29_TWIHS0_Msk & ((value) << SAIC_IPR0_PID29_TWIHS0_Pos))
#define SAIC_IPR0_PID30_TWIHS1_Pos            (30U)                                          /**< (SAIC_IPR0) Interrupt Pending Position */
#define SAIC_IPR0_PID30_TWIHS1_Msk            (0x1U << SAIC_IPR0_PID30_TWIHS1_Pos)           /**< (SAIC_IPR0) Interrupt Pending Mask */
#define SAIC_IPR0_PID30_TWIHS1(value)         (SAIC_IPR0_PID30_TWIHS1_Msk & ((value) << SAIC_IPR0_PID30_TWIHS1_Pos))
#define SAIC_IPR0_Msk                         (0x7FDFFFFDUL)                                 /**< (SAIC_IPR0) Register Mask  */

/* -------- SAIC_IPR1 : (SAIC Offset: 0x24) (R/  32) Interrupt Pending Register 1 -------- */
#define SAIC_IPR1_PID32_SDMMC1_Pos            (0U)                                           /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID32_SDMMC1_Msk            (0x1U << SAIC_IPR1_PID32_SDMMC1_Pos)           /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID32_SDMMC1(value)         (SAIC_IPR1_PID32_SDMMC1_Msk & ((value) << SAIC_IPR1_PID32_SDMMC1_Pos))
#define SAIC_IPR1_PID33_SPI0_Pos              (1U)                                           /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID33_SPI0_Msk              (0x1U << SAIC_IPR1_PID33_SPI0_Pos)             /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID33_SPI0(value)           (SAIC_IPR1_PID33_SPI0_Msk & ((value) << SAIC_IPR1_PID33_SPI0_Pos))
#define SAIC_IPR1_PID34_SPI1_Pos              (2U)                                           /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID34_SPI1_Msk              (0x1U << SAIC_IPR1_PID34_SPI1_Pos)             /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID34_SPI1(value)           (SAIC_IPR1_PID34_SPI1_Msk & ((value) << SAIC_IPR1_PID34_SPI1_Pos))
#define SAIC_IPR1_PID35_TC0_Pos               (3U)                                           /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID35_TC0_Msk               (0x1U << SAIC_IPR1_PID35_TC0_Pos)              /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID35_TC0(value)            (SAIC_IPR1_PID35_TC0_Msk & ((value) << SAIC_IPR1_PID35_TC0_Pos))
#define SAIC_IPR1_PID36_TC1_Pos               (4U)                                           /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID36_TC1_Msk               (0x1U << SAIC_IPR1_PID36_TC1_Pos)              /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID36_TC1(value)            (SAIC_IPR1_PID36_TC1_Msk & ((value) << SAIC_IPR1_PID36_TC1_Pos))
#define SAIC_IPR1_PID38_PWM_Pos               (6U)                                           /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID38_PWM_Msk               (0x1U << SAIC_IPR1_PID38_PWM_Pos)              /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID38_PWM(value)            (SAIC_IPR1_PID38_PWM_Msk & ((value) << SAIC_IPR1_PID38_PWM_Pos))
#define SAIC_IPR1_PID40_ADC_Pos               (8U)                                           /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID40_ADC_Msk               (0x1U << SAIC_IPR1_PID40_ADC_Pos)              /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID40_ADC(value)            (SAIC_IPR1_PID40_ADC_Msk & ((value) << SAIC_IPR1_PID40_ADC_Pos))
#define SAIC_IPR1_PID41_UHPHS_Pos             (9U)                                           /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID41_UHPHS_Msk             (0x1U << SAIC_IPR1_PID41_UHPHS_Pos)            /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID41_UHPHS(value)          (SAIC_IPR1_PID41_UHPHS_Msk & ((value) << SAIC_IPR1_PID41_UHPHS_Pos))
#define SAIC_IPR1_PID42_UDPHS_Pos             (10U)                                          /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID42_UDPHS_Msk             (0x1U << SAIC_IPR1_PID42_UDPHS_Pos)            /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID42_UDPHS(value)          (SAIC_IPR1_PID42_UDPHS_Msk & ((value) << SAIC_IPR1_PID42_UDPHS_Pos))
#define SAIC_IPR1_PID43_SSC0_Pos              (11U)                                          /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID43_SSC0_Msk              (0x1U << SAIC_IPR1_PID43_SSC0_Pos)             /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID43_SSC0(value)           (SAIC_IPR1_PID43_SSC0_Msk & ((value) << SAIC_IPR1_PID43_SSC0_Pos))
#define SAIC_IPR1_PID44_SSC1_Pos              (12U)                                          /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID44_SSC1_Msk              (0x1U << SAIC_IPR1_PID44_SSC1_Pos)             /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID44_SSC1(value)           (SAIC_IPR1_PID44_SSC1_Msk & ((value) << SAIC_IPR1_PID44_SSC1_Pos))
#define SAIC_IPR1_PID45_LCDC_Pos              (13U)                                          /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID45_LCDC_Msk              (0x1U << SAIC_IPR1_PID45_LCDC_Pos)             /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID45_LCDC(value)           (SAIC_IPR1_PID45_LCDC_Msk & ((value) << SAIC_IPR1_PID45_LCDC_Pos))
#define SAIC_IPR1_PID46_ISC_Pos               (14U)                                          /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID46_ISC_Msk               (0x1U << SAIC_IPR1_PID46_ISC_Pos)              /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID46_ISC(value)            (SAIC_IPR1_PID46_ISC_Msk & ((value) << SAIC_IPR1_PID46_ISC_Pos))
#define SAIC_IPR1_PID47_TRNG_Pos              (15U)                                          /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID47_TRNG_Msk              (0x1U << SAIC_IPR1_PID47_TRNG_Pos)             /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID47_TRNG(value)           (SAIC_IPR1_PID47_TRNG_Msk & ((value) << SAIC_IPR1_PID47_TRNG_Pos))
#define SAIC_IPR1_PID48_PDMIC_Pos             (16U)                                          /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID48_PDMIC_Msk             (0x1U << SAIC_IPR1_PID48_PDMIC_Pos)            /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID48_PDMIC(value)          (SAIC_IPR1_PID48_PDMIC_Msk & ((value) << SAIC_IPR1_PID48_PDMIC_Pos))
#define SAIC_IPR1_PID50_SFC_Pos               (18U)                                          /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID50_SFC_Msk               (0x1U << SAIC_IPR1_PID50_SFC_Pos)              /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID50_SFC(value)            (SAIC_IPR1_PID50_SFC_Msk & ((value) << SAIC_IPR1_PID50_SFC_Pos))
#define SAIC_IPR1_PID51_SECURAM_Pos           (19U)                                          /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID51_SECURAM_Msk           (0x1U << SAIC_IPR1_PID51_SECURAM_Pos)          /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID51_SECURAM(value)        (SAIC_IPR1_PID51_SECURAM_Msk & ((value) << SAIC_IPR1_PID51_SECURAM_Pos))
#define SAIC_IPR1_PID52_QSPI0_Pos             (20U)                                          /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID52_QSPI0_Msk             (0x1U << SAIC_IPR1_PID52_QSPI0_Pos)            /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID52_QSPI0(value)          (SAIC_IPR1_PID52_QSPI0_Msk & ((value) << SAIC_IPR1_PID52_QSPI0_Pos))
#define SAIC_IPR1_PID53_QSPI1_Pos             (21U)                                          /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID53_QSPI1_Msk             (0x1U << SAIC_IPR1_PID53_QSPI1_Pos)            /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID53_QSPI1(value)          (SAIC_IPR1_PID53_QSPI1_Msk & ((value) << SAIC_IPR1_PID53_QSPI1_Pos))
#define SAIC_IPR1_PID54_I2SC0_Pos             (22U)                                          /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID54_I2SC0_Msk             (0x1U << SAIC_IPR1_PID54_I2SC0_Pos)            /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID54_I2SC0(value)          (SAIC_IPR1_PID54_I2SC0_Msk & ((value) << SAIC_IPR1_PID54_I2SC0_Pos))
#define SAIC_IPR1_PID55_I2SC1_Pos             (23U)                                          /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID55_I2SC1_Msk             (0x1U << SAIC_IPR1_PID55_I2SC1_Pos)            /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID55_I2SC1(value)          (SAIC_IPR1_PID55_I2SC1_Msk & ((value) << SAIC_IPR1_PID55_I2SC1_Pos))
#define SAIC_IPR1_PID56_MCAN0_Pos             (24U)                                          /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID56_MCAN0_Msk             (0x1U << SAIC_IPR1_PID56_MCAN0_Pos)            /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID56_MCAN0(value)          (SAIC_IPR1_PID56_MCAN0_Msk & ((value) << SAIC_IPR1_PID56_MCAN0_Pos))
#define SAIC_IPR1_PID58_PTC_Pos               (26U)                                          /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID58_PTC_Msk               (0x1U << SAIC_IPR1_PID58_PTC_Pos)              /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID58_PTC(value)            (SAIC_IPR1_PID58_PTC_Msk & ((value) << SAIC_IPR1_PID58_PTC_Pos))
#define SAIC_IPR1_PID59_CLASSD_Pos            (27U)                                          /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID59_CLASSD_Msk            (0x1U << SAIC_IPR1_PID59_CLASSD_Pos)           /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID59_CLASSD(value)         (SAIC_IPR1_PID59_CLASSD_Msk & ((value) << SAIC_IPR1_PID59_CLASSD_Pos))
#define SAIC_IPR1_PID63_L2CC_Pos              (31U)                                          /**< (SAIC_IPR1) Interrupt Pending Position */
#define SAIC_IPR1_PID63_L2CC_Msk              (0x1U << SAIC_IPR1_PID63_L2CC_Pos)             /**< (SAIC_IPR1) Interrupt Pending Mask */
#define SAIC_IPR1_PID63_L2CC(value)           (SAIC_IPR1_PID63_L2CC_Msk & ((value) << SAIC_IPR1_PID63_L2CC_Pos))
#define SAIC_IPR1_Msk                         (0x8DFDFF5FUL)                                 /**< (SAIC_IPR1) Register Mask  */

