Microchip-MPLAB-Harmony/csp/apps/rtc/rtc_alarm/firmware/src/packs/ATSAMA5D27_DFP/component/saic.h
/* -------- SAIC_IPR2 : (SAIC Offset: 0x28) (R/  32) Interrupt Pending Register 2 -------- */
#define SAIC_IPR2_PID64_MCAN0_INT1_Pos        (0U)                                           /**< (SAIC_IPR2) Interrupt Pending Position */
#define SAIC_IPR2_PID64_MCAN0_INT1_Msk        (0x1U << SAIC_IPR2_PID64_MCAN0_INT1_Pos)       /**< (SAIC_IPR2) Interrupt Pending Mask */
#define SAIC_IPR2_PID64_MCAN0_INT1(value)     (SAIC_IPR2_PID64_MCAN0_INT1_Msk & ((value) << SAIC_IPR2_PID64_MCAN0_INT1_Pos))
#define SAIC_IPR2_PID66_GMAC_Q1_Pos           (2U)                                           /**< (SAIC_IPR2) Interrupt Pending Position */
#define SAIC_IPR2_PID66_GMAC_Q1_Msk           (0x1U << SAIC_IPR2_PID66_GMAC_Q1_Pos)          /**< (SAIC_IPR2) Interrupt Pending Mask */
#define SAIC_IPR2_PID66_GMAC_Q1(value)        (SAIC_IPR2_PID66_GMAC_Q1_Msk & ((value) << SAIC_IPR2_PID66_GMAC_Q1_Pos))
#define SAIC_IPR2_PID67_GMAC_Q2_Pos           (3U)                                           /**< (SAIC_IPR2) Interrupt Pending Position */
#define SAIC_IPR2_PID67_GMAC_Q2_Msk           (0x1U << SAIC_IPR2_PID67_GMAC_Q2_Pos)          /**< (SAIC_IPR2) Interrupt Pending Mask */
#define SAIC_IPR2_PID67_GMAC_Q2(value)        (SAIC_IPR2_PID67_GMAC_Q2_Msk & ((value) << SAIC_IPR2_PID67_GMAC_Q2_Pos))
#define SAIC_IPR2_PID68_PIOB_Pos              (4U)                                           /**< (SAIC_IPR2) Interrupt Pending Position */
#define SAIC_IPR2_PID68_PIOB_Msk              (0x1U << SAIC_IPR2_PID68_PIOB_Pos)             /**< (SAIC_IPR2) Interrupt Pending Mask */
#define SAIC_IPR2_PID68_PIOB(value)           (SAIC_IPR2_PID68_PIOB_Msk & ((value) << SAIC_IPR2_PID68_PIOB_Pos))
#define SAIC_IPR2_PID69_PIOC_Pos              (5U)                                           /**< (SAIC_IPR2) Interrupt Pending Position */
#define SAIC_IPR2_PID69_PIOC_Msk              (0x1U << SAIC_IPR2_PID69_PIOC_Pos)             /**< (SAIC_IPR2) Interrupt Pending Mask */
#define SAIC_IPR2_PID69_PIOC(value)           (SAIC_IPR2_PID69_PIOC_Msk & ((value) << SAIC_IPR2_PID69_PIOC_Pos))
#define SAIC_IPR2_PID70_PIOD_Pos              (6U)                                           /**< (SAIC_IPR2) Interrupt Pending Position */
#define SAIC_IPR2_PID70_PIOD_Msk              (0x1U << SAIC_IPR2_PID70_PIOD_Pos)             /**< (SAIC_IPR2) Interrupt Pending Mask */
#define SAIC_IPR2_PID70_PIOD(value)           (SAIC_IPR2_PID70_PIOD_Msk & ((value) << SAIC_IPR2_PID70_PIOD_Pos))
#define SAIC_IPR2_PID72_SDMMC1_TIMER_Pos      (8U)                                           /**< (SAIC_IPR2) Interrupt Pending Position */
#define SAIC_IPR2_PID72_SDMMC1_TIMER_Msk      (0x1U << SAIC_IPR2_PID72_SDMMC1_TIMER_Pos)     /**< (SAIC_IPR2) Interrupt Pending Mask */
#define SAIC_IPR2_PID72_SDMMC1_TIMER(value)   (SAIC_IPR2_PID72_SDMMC1_TIMER_Msk & ((value) << SAIC_IPR2_PID72_SDMMC1_TIMER_Pos))
#define SAIC_IPR2_PID74_SYSC_Pos              (10U)                                          /**< (SAIC_IPR2) Interrupt Pending Position */
#define SAIC_IPR2_PID74_SYSC_Msk              (0x1U << SAIC_IPR2_PID74_SYSC_Pos)             /**< (SAIC_IPR2) Interrupt Pending Mask */
#define SAIC_IPR2_PID74_SYSC(value)           (SAIC_IPR2_PID74_SYSC_Msk & ((value) << SAIC_IPR2_PID74_SYSC_Pos))
#define SAIC_IPR2_PID75_ACC_Pos               (11U)                                          /**< (SAIC_IPR2) Interrupt Pending Position */
#define SAIC_IPR2_PID75_ACC_Msk               (0x1U << SAIC_IPR2_PID75_ACC_Pos)              /**< (SAIC_IPR2) Interrupt Pending Mask */
#define SAIC_IPR2_PID75_ACC(value)            (SAIC_IPR2_PID75_ACC_Msk & ((value) << SAIC_IPR2_PID75_ACC_Pos))
#define SAIC_IPR2_PID76_RXLP_Pos              (12U)                                          /**< (SAIC_IPR2) Interrupt Pending Position */
#define SAIC_IPR2_PID76_RXLP_Msk              (0x1U << SAIC_IPR2_PID76_RXLP_Pos)             /**< (SAIC_IPR2) Interrupt Pending Mask */
#define SAIC_IPR2_PID76_RXLP(value)           (SAIC_IPR2_PID76_RXLP_Msk & ((value) << SAIC_IPR2_PID76_RXLP_Pos))
#define SAIC_IPR2_Msk                         (0x00001D7DUL)                                 /**< (SAIC_IPR2) Register Mask  */

/* -------- SAIC_IMR : (SAIC Offset: 0x30) (R/  32) Interrupt Mask Register -------- */
#define SAIC_IMR_INTM_Pos                     (0U)                                           /**< (SAIC_IMR) Interrupt Mask Position */
#define SAIC_IMR_INTM_Msk                     (0x1U << SAIC_IMR_INTM_Pos)                    /**< (SAIC_IMR) Interrupt Mask Mask */
#define SAIC_IMR_INTM(value)                  (SAIC_IMR_INTM_Msk & ((value) << SAIC_IMR_INTM_Pos))
#define SAIC_IMR_Msk                          (0x00000001UL)                                 /**< (SAIC_IMR) Register Mask  */

/* -------- SAIC_CISR : (SAIC Offset: 0x34) (R/  32) Core Interrupt Status Register -------- */
#define SAIC_CISR_NFIQ_Pos                    (0U)                                           /**< (SAIC_CISR) NFIQ Status Position */
#define SAIC_CISR_NFIQ_Msk                    (0x1U << SAIC_CISR_NFIQ_Pos)                   /**< (SAIC_CISR) NFIQ Status Mask */
#define SAIC_CISR_NFIQ(value)                 (SAIC_CISR_NFIQ_Msk & ((value) << SAIC_CISR_NFIQ_Pos))
#define SAIC_CISR_NIRQ_Pos                    (1U)                                           /**< (SAIC_CISR) NIRQ Status Position */
#define SAIC_CISR_NIRQ_Msk                    (0x1U << SAIC_CISR_NIRQ_Pos)                   /**< (SAIC_CISR) NIRQ Status Mask */
#define SAIC_CISR_NIRQ(value)                 (SAIC_CISR_NIRQ_Msk & ((value) << SAIC_CISR_NIRQ_Pos))
#define SAIC_CISR_Msk                         (0x00000003UL)                                 /**< (SAIC_CISR) Register Mask  */

/* -------- SAIC_EOICR : (SAIC Offset: 0x38) ( /W 32) End of Interrupt Command Register -------- */
#define SAIC_EOICR_ENDIT_Pos                  (0U)                                           /**< (SAIC_EOICR) Interrupt Processing Complete Command Position */
#define SAIC_EOICR_ENDIT_Msk                  (0x1U << SAIC_EOICR_ENDIT_Pos)                 /**< (SAIC_EOICR) Interrupt Processing Complete Command Mask */
#define SAIC_EOICR_ENDIT(value)               (SAIC_EOICR_ENDIT_Msk & ((value) << SAIC_EOICR_ENDIT_Pos))
#define SAIC_EOICR_Msk                        (0x00000001UL)                                 /**< (SAIC_EOICR) Register Mask  */

