Microchip-MPLAB-Harmony/csp/apps/rtc/rtc_alarm/firmware/src/packs/ATSAMA5D27_DFP/component/saic.h
/* -------- SAIC_SPU : (SAIC Offset: 0x3C) (R/W 32) Spurious Interrupt Vector Register -------- */
#define SAIC_SPU_SIVR_Pos                     (0U)                                           /**< (SAIC_SPU) Spurious Interrupt Vector Register Position */
#define SAIC_SPU_SIVR_Msk                     (0xFFFFFFFFU << SAIC_SPU_SIVR_Pos)             /**< (SAIC_SPU) Spurious Interrupt Vector Register Mask */
#define SAIC_SPU_SIVR(value)                  (SAIC_SPU_SIVR_Msk & ((value) << SAIC_SPU_SIVR_Pos))
#define SAIC_SPU_Msk                          (0xFFFFFFFFUL)                                 /**< (SAIC_SPU) Register Mask  */

/* -------- SAIC_IECR : (SAIC Offset: 0x40) ( /W 32) Interrupt Enable Command Register -------- */
#define SAIC_IECR_INTEN_Pos                   (0U)                                           /**< (SAIC_IECR) Interrupt Enable Position */
#define SAIC_IECR_INTEN_Msk                   (0x1U << SAIC_IECR_INTEN_Pos)                  /**< (SAIC_IECR) Interrupt Enable Mask */
#define SAIC_IECR_INTEN(value)                (SAIC_IECR_INTEN_Msk & ((value) << SAIC_IECR_INTEN_Pos))
#define SAIC_IECR_Msk                         (0x00000001UL)                                 /**< (SAIC_IECR) Register Mask  */

/* -------- SAIC_IDCR : (SAIC Offset: 0x44) ( /W 32) Interrupt Disable Command Register -------- */
#define SAIC_IDCR_INTD_Pos                    (0U)                                           /**< (SAIC_IDCR) Interrupt Disable Position */
#define SAIC_IDCR_INTD_Msk                    (0x1U << SAIC_IDCR_INTD_Pos)                   /**< (SAIC_IDCR) Interrupt Disable Mask */
#define SAIC_IDCR_INTD(value)                 (SAIC_IDCR_INTD_Msk & ((value) << SAIC_IDCR_INTD_Pos))
#define SAIC_IDCR_Msk                         (0x00000001UL)                                 /**< (SAIC_IDCR) Register Mask  */

/* -------- SAIC_ICCR : (SAIC Offset: 0x48) ( /W 32) Interrupt Clear Command Register -------- */
#define SAIC_ICCR_INTCLR_Pos                  (0U)                                           /**< (SAIC_ICCR) Interrupt Clear Position */
#define SAIC_ICCR_INTCLR_Msk                  (0x1U << SAIC_ICCR_INTCLR_Pos)                 /**< (SAIC_ICCR) Interrupt Clear Mask */
#define SAIC_ICCR_INTCLR(value)               (SAIC_ICCR_INTCLR_Msk & ((value) << SAIC_ICCR_INTCLR_Pos))
#define SAIC_ICCR_Msk                         (0x00000001UL)                                 /**< (SAIC_ICCR) Register Mask  */

/* -------- SAIC_ISCR : (SAIC Offset: 0x4C) ( /W 32) Interrupt Set Command Register -------- */
#define SAIC_ISCR_INTSET_Pos                  (0U)                                           /**< (SAIC_ISCR) Interrupt Set Position */
#define SAIC_ISCR_INTSET_Msk                  (0x1U << SAIC_ISCR_INTSET_Pos)                 /**< (SAIC_ISCR) Interrupt Set Mask */
#define SAIC_ISCR_INTSET(value)               (SAIC_ISCR_INTSET_Msk & ((value) << SAIC_ISCR_INTSET_Pos))
#define SAIC_ISCR_Msk                         (0x00000001UL)                                 /**< (SAIC_ISCR) Register Mask  */

/* -------- SAIC_DCR : (SAIC Offset: 0x6C) (R/W 32) Debug Control Register -------- */
#define SAIC_DCR_PROT_Pos                     (0U)                                           /**< (SAIC_DCR) Protection Mode Position */
#define SAIC_DCR_PROT_Msk                     (0x1U << SAIC_DCR_PROT_Pos)                    /**< (SAIC_DCR) Protection Mode Mask */
#define SAIC_DCR_PROT(value)                  (SAIC_DCR_PROT_Msk & ((value) << SAIC_DCR_PROT_Pos))
#define SAIC_DCR_GMSK_Pos                     (1U)                                           /**< (SAIC_DCR) General Interrupt Mask Position */
#define SAIC_DCR_GMSK_Msk                     (0x1U << SAIC_DCR_GMSK_Pos)                    /**< (SAIC_DCR) General Interrupt Mask Mask */
#define SAIC_DCR_GMSK(value)                  (SAIC_DCR_GMSK_Msk & ((value) << SAIC_DCR_GMSK_Pos))
#define SAIC_DCR_Msk                          (0x00000003UL)                                 /**< (SAIC_DCR) Register Mask  */

/* -------- SAIC_WPMR : (SAIC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define SAIC_WPMR_WPEN_Pos                    (0U)                                           /**< (SAIC_WPMR) Write Protection Enable Position */
#define SAIC_WPMR_WPEN_Msk                    (0x1U << SAIC_WPMR_WPEN_Pos)                   /**< (SAIC_WPMR) Write Protection Enable Mask */
#define SAIC_WPMR_WPEN(value)                 (SAIC_WPMR_WPEN_Msk & ((value) << SAIC_WPMR_WPEN_Pos))
#define SAIC_WPMR_WPKEY_Pos                   (8U)                                           /**< (SAIC_WPMR) Write Protection Key Position */
#define SAIC_WPMR_WPKEY_Msk                   (0xFFFFFFU << SAIC_WPMR_WPKEY_Pos)             /**< (SAIC_WPMR) Write Protection Key Mask */
#define SAIC_WPMR_WPKEY(value)                (SAIC_WPMR_WPKEY_Msk & ((value) << SAIC_WPMR_WPKEY_Pos))
#define   SAIC_WPMR_WPKEY_PASSWD_Val          (4278595U)                                     /**< (SAIC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define SAIC_WPMR_WPKEY_PASSWD                (SAIC_WPMR_WPKEY_PASSWD_Val << SAIC_WPMR_WPKEY_Pos) /**< (SAIC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define SAIC_WPMR_Msk                         (0xFFFFFF01UL)                                 /**< (SAIC_WPMR) Register Mask  */

/* -------- SAIC_WPSR : (SAIC Offset: 0xE8) (R/  32) Write Protection Status Register -------- */
#define SAIC_WPSR_WPVS_Pos                    (0U)                                           /**< (SAIC_WPSR) Write Protection Violation Status Position */
#define SAIC_WPSR_WPVS_Msk                    (0x1U << SAIC_WPSR_WPVS_Pos)                   /**< (SAIC_WPSR) Write Protection Violation Status Mask */
#define SAIC_WPSR_WPVS(value)                 (SAIC_WPSR_WPVS_Msk & ((value) << SAIC_WPSR_WPVS_Pos))
#define SAIC_WPSR_WPVSRC_Pos                  (8U)                                           /**< (SAIC_WPSR) Write Protection Violation Source Position */
#define SAIC_WPSR_WPVSRC_Msk                  (0xFFFFU << SAIC_WPSR_WPVSRC_Pos)              /**< (SAIC_WPSR) Write Protection Violation Source Mask */
#define SAIC_WPSR_WPVSRC(value)               (SAIC_WPSR_WPVSRC_Msk & ((value) << SAIC_WPSR_WPVSRC_Pos))
#define SAIC_WPSR_Msk                         (0x00FFFF01UL)                                 /**< (SAIC_WPSR) Register Mask  */

/* -------- SAIC_VERSION : (SAIC Offset: 0xFC) (R/  32) AIC Version Register -------- */
#define SAIC_VERSION_VERSION_Pos              (0U)                                           /**< (SAIC_VERSION) Version of the Hardware Module Position */
#define SAIC_VERSION_VERSION_Msk              (0xFFFU << SAIC_VERSION_VERSION_Pos)           /**< (SAIC_VERSION) Version of the Hardware Module Mask */
#define SAIC_VERSION_VERSION(value)           (SAIC_VERSION_VERSION_Msk & ((value) << SAIC_VERSION_VERSION_Pos))
#define SAIC_VERSION_MFN_Pos                  (16U)                                          /**< (SAIC_VERSION) Metal Fix Number Position */
#define SAIC_VERSION_MFN_Msk                  (0x7U << SAIC_VERSION_MFN_Pos)                 /**< (SAIC_VERSION) Metal Fix Number Mask */
#define SAIC_VERSION_MFN(value)               (SAIC_VERSION_MFN_Msk & ((value) << SAIC_VERSION_MFN_Pos))
#define SAIC_VERSION_Msk                      (0x00070FFFUL)                                 /**< (SAIC_VERSION) Register Mask  */

/** \brief SAIC register offsets definitions */
#define SAIC_SSR_OFFSET                (0x00)         /**< (SAIC_SSR) Source Select Register Offset */
#define SAIC_SMR_OFFSET                (0x04)         /**< (SAIC_SMR) Source Mode Register Offset */
#define SAIC_SVR_OFFSET                (0x08)         /**< (SAIC_SVR) Source Vector Register Offset */
#define SAIC_IVR_OFFSET                (0x10)         /**< (SAIC_IVR) Interrupt Vector Register Offset */
#define SAIC_FVR_OFFSET                (0x14)         /**< (SAIC_FVR) FIQ Vector Register Offset */
#define SAIC_ISR_OFFSET                (0x18)         /**< (SAIC_ISR) Interrupt Status Register Offset */
#define SAIC_IPR0_OFFSET               (0x20)         /**< (SAIC_IPR0) Interrupt Pending Register 0 Offset */
#define SAIC_IPR1_OFFSET               (0x24)         /**< (SAIC_IPR1) Interrupt Pending Register 1 Offset */
#define SAIC_IPR2_OFFSET               (0x28)         /**< (SAIC_IPR2) Interrupt Pending Register 2 Offset */
#define SAIC_IMR_OFFSET                (0x30)         /**< (SAIC_IMR) Interrupt Mask Register Offset */
#define SAIC_CISR_OFFSET               (0x34)         /**< (SAIC_CISR) Core Interrupt Status Register Offset */
#define SAIC_EOICR_OFFSET              (0x38)         /**< (SAIC_EOICR) End of Interrupt Command Register Offset */
#define SAIC_SPU_OFFSET                (0x3C)         /**< (SAIC_SPU) Spurious Interrupt Vector Register Offset */
#define SAIC_IECR_OFFSET               (0x40)         /**< (SAIC_IECR) Interrupt Enable Command Register Offset */
#define SAIC_IDCR_OFFSET               (0x44)         /**< (SAIC_IDCR) Interrupt Disable Command Register Offset */
#define SAIC_ICCR_OFFSET               (0x48)         /**< (SAIC_ICCR) Interrupt Clear Command Register Offset */
#define SAIC_ISCR_OFFSET               (0x4C)         /**< (SAIC_ISCR) Interrupt Set Command Register Offset */
#define SAIC_DCR_OFFSET                (0x6C)         /**< (SAIC_DCR) Debug Control Register Offset */
#define SAIC_WPMR_OFFSET               (0xE4)         /**< (SAIC_WPMR) Write Protection Mode Register Offset */
#define SAIC_WPSR_OFFSET               (0xE8)         /**< (SAIC_WPSR) Write Protection Status Register Offset */
#define SAIC_VERSION_OFFSET            (0xFC)         /**< (SAIC_VERSION) AIC Version Register Offset */

/** \brief SAIC register API structure */
typedef struct
{
  __IO  uint32_t                       SAIC_SSR;        /**< Offset: 0x00 (R/W  32) Source Select Register */
  __IO  uint32_t                       SAIC_SMR;        /**< Offset: 0x04 (R/W  32) Source Mode Register */
  __IO  uint32_t                       SAIC_SVR;        /**< Offset: 0x08 (R/W  32) Source Vector Register */
  __I   uint8_t                        Reserved1[0x04];
  __I   uint32_t                       SAIC_IVR;        /**< Offset: 0x10 (R/   32) Interrupt Vector Register */
  __I   uint32_t                       SAIC_FVR;        /**< Offset: 0x14 (R/   32) FIQ Vector Register */
  __I   uint32_t                       SAIC_ISR;        /**< Offset: 0x18 (R/   32) Interrupt Status Register */
  __I   uint8_t                        Reserved2[0x04];
  __I   uint32_t                       SAIC_IPR0;       /**< Offset: 0x20 (R/   32) Interrupt Pending Register 0 */
  __I   uint32_t                       SAIC_IPR1;       /**< Offset: 0x24 (R/   32) Interrupt Pending Register 1 */
  __I   uint32_t                       SAIC_IPR2;       /**< Offset: 0x28 (R/   32) Interrupt Pending Register 2 */
  __I   uint8_t                        Reserved3[0x04];
  __I   uint32_t                       SAIC_IMR;        /**< Offset: 0x30 (R/   32) Interrupt Mask Register */
  __I   uint32_t                       SAIC_CISR;       /**< Offset: 0x34 (R/   32) Core Interrupt Status Register */
  __O   uint32_t                       SAIC_EOICR;      /**< Offset: 0x38 ( /W  32) End of Interrupt Command Register */
  __IO  uint32_t                       SAIC_SPU;        /**< Offset: 0x3c (R/W  32) Spurious Interrupt Vector Register */
  __O   uint32_t                       SAIC_IECR;       /**< Offset: 0x40 ( /W  32) Interrupt Enable Command Register */
  __O   uint32_t                       SAIC_IDCR;       /**< Offset: 0x44 ( /W  32) Interrupt Disable Command Register */
  __O   uint32_t                       SAIC_ICCR;       /**< Offset: 0x48 ( /W  32) Interrupt Clear Command Register */
  __O   uint32_t                       SAIC_ISCR;       /**< Offset: 0x4c ( /W  32) Interrupt Set Command Register */
  __I   uint8_t                        Reserved4[0x1C];
  __IO  uint32_t                       SAIC_DCR;        /**< Offset: 0x6c (R/W  32) Debug Control Register */
  __I   uint8_t                        Reserved5[0x74];
  __IO  uint32_t                       SAIC_WPMR;       /**< Offset: 0xe4 (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       SAIC_WPSR;       /**< Offset: 0xe8 (R/   32) Write Protection Status Register */
  __I   uint8_t                        Reserved6[0x10];
  __I   uint32_t                       SAIC_VERSION;    /**< Offset: 0xfc (R/   32) AIC Version Register */
} saic_registers_t;
/** @}  end of Secure Advanced Interrupt Controller */

#endif /* SAMA5D2_SAMA5D2_SAIC_MODULE_H */

